Revit 2027 API
RibbonItem.ItemText Property
Gets or sets the text displayed on the item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual string ItemText { get; set; }
Public Overridable Property ItemText As String
	Get
	Set
public:
virtual property String^ ItemText {
	String^ get ();
	void set (String^ value);
}
abstract ItemText : string with get, set
override ItemText : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  Thrown when setting the text to empty or to the string contains "%".
ArgumentNullException |  Thrown when setting the text to null.
Remarks
The text can be changed at run time. null or empty string is not allowed.
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace